In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame([10,20,30,40], columns=['numbers'], index=['a', 'b', 'c', 'd'])

In [3]:
df

   numbers
a       10
b       20
c       30
d       40

In [9]:
# Cell selection reverse of RC cola - Column then Row by label
df['numbers']['b']

20

In [10]:
# get rows
df.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [11]:
# get columns
df.columns

Index(['numbers'], dtype='object')

In [14]:
# lookup by row id
df.loc['c']

numbers    30
Name: c, dtype: int64

In [15]:
df.iloc[1:3] # lookup by row index inclusive to exclusive

   numbers
b       20
c       30

In [18]:
df.loc[['a', 'd']] # multi-lookup single row

   numbers
a       10
d       40

In [20]:
df.sum() # sum per column

numbers    100
dtype: int64

In [23]:
df['numbers'].apply(lambda x : x**2) # lambda function on all members of column

a     100
b     400
c     900
d    1600
Name: numbers, dtype: int64

In [26]:
df ** 2 # same on whole df

   numbers
a      100
b      400
c      900
d     1600

In [29]:
# Adding a column - provide a tuple
df['floats'] = (1.5, 2.5, 3.5, 4.5)
df

   numbers  floats
a       10     1.5
b       20     2.5
c       30     3.5
d       40     4.5

In [31]:
# add a column by adding a dataframe, specifying index mapping
df['names'] = pd.DataFrame(['Yves', 'Sandra', 'Lilli', 'Henry'], index=['d', 'a', 'b', 'c'])
df

   numbers  floats   names
a       10     1.5  Sandra
b       20     2.5   Lilli
c       30     3.5   Henry
d       40     4.5    Yves

In [36]:
# When appending, always include the index, or you lose all indices
df = df.append(pd.DataFrame({'numbers': 50, 'floats': '5.2', 'names': 'Mork'}, index=['y',]))
df

   numbers floats   names
a       10    1.5  Sandra
b       20    2.5   Lilli
c       30    3.5   Henry
d       40    4.5    Yves
y       50    5.2    Mork